<?php

require 'CustomXLSX.php';

$arr_for_xlsx = [
    [100, '', 50, '', '', '', '', '', 12, 1, 3],  # šířka sloupce
    ['<b>tučně', '', '', '', '', '', '', '', '', '', ''], 
    ['', '', '', '', '', '', '', '', '', '', ''], 
    ['', '<b><ce>vycentrovaný tučný text', '', '', '', '', '', '<ce>vycentrovaný text', '', '', ''], 
    ['', '<bg#FF0000>', '', '', '', '', '', '', '', '', ''], 
    ['', '<bg#FF0000>', '', '<ce><b><bg#FF0000>červené pozadí, tučný text, vycentrovat', '', '', '', '', '', '', ''], 
    ['', '<bg#FF0000>červené pozadí', '', '', '', '', '', '', '', '', ''], 
    ['', '<bg#FF0000>', '', '', '', '', '', '', '', '', ''], 
    ['', '<b><bg#FF0000>červené pozadí, tučný text', '', '', '', '', '', '', '', '', ''], 
    ['', '', '', '', '<b>tučný text', '', '', '', '', '', ''], 
    ['', '', '', '', '', '', '', '', '', '', ''], 
    ['', '', '', '', '', '', '', '', '', '', ''], 
];

$xlsx = new CustomXLSX();
$xlsx->Input($arr_for_xlsx);